
/*!
 *  @header BAKit.h
 *
 *  @brief  BAKit
 *
 *  @author 博爱
 *  @copyright  Copyright © 2016年 博爱. All rights reserved.
 *  @version    V1.0
 */

//                            _ooOoo_
//                           o8888888o
//                           88" . "88
//                           (| -_- |)
//                            O\ = /O
//                        ____/`---'\____
//                      .   ' \\| |// `.
//                       / \\||| : |||// \
//                     / _||||| -:- |||||- \
//                       | | \\\ - /// | |
//                     | \_| ''\---/'' | |
//                      \ .-\__ `-` ___/-. /
//                   ___`. .' /--.--\ `. . __
//                ."" '< `.___\_<|>_/___.' >'"".
//               | | : `- \`.;`\ _ /`;.`/ - ` : | |
//                 \ \ `-. \_ __\ /__ _/ .-` / /
//         ======`-.____`-.___\_____/___.-`____.-'======
//                            `=---='
//
//         .............................................
//                  佛祖镇楼                  BUG辟易
//          佛曰:
//                  写字楼里写字间，写字间里程序员；
//                  程序人员写程序，又拿程序换酒钱。
//                  酒醒只在网上坐，酒醉还来网下眠；
//                  酒醉酒醒日复日，网上网下年复年。
//                  但愿老死电脑间，不愿鞠躬老板前；
//                  奔驰宝马贵者趣，公交自行程序员。
//                  别人笑我忒疯癫，我笑自己命太贱；
//                  不见满街漂亮妹，哪个归得程序员？

/*
 
 *********************************************************************************
 *
 * 在使用 BAKit 的过程中如果出现 bug 请及时以以下任意一种方式联系我，我会及时修复 bug
 *
 * QQ     : 可以添加ios开发技术群 479663605 在这里找到我(博爱1616【137361770】)
 * 微博    : 博爱1616
 * Email  : 137361770@qq.com
 * GitHub : https://github.com/boai
 * BAHome : https://github.com/BAHome
 * 博客    : http://boaihome.com
 
 *********************************************************************************
 
 */


#ifndef BANetManager_OC_h
#define BANetManager_OC_h

#import "BANetManager.h"

/*!
 *********************************************************************************
 ************************************ 更新说明 ************************************
 *********************************************************************************
 
 欢迎使用 BAHome 系列开源代码 ！
 如有更多需求，请前往：https://github.com/BAHome
 
 项目源码地址：
 OC 版 ：https://github.com/BAHome/BANetManager
 
 最新更新时间：2017-07-17 【倒叙】<br>
 最新Version：【Version：2.3.3】<br>
 更新内容：<br>
 2.3.3.1、新增 清除 请求头<br>
 2.3.3.2、新增 文件上传<br>
 2.3.3.3、优化多图上传<br>
 
 最新更新时间：2017-05-03 【倒叙】<br>
 最新Version：【Version：2.2】<br>
 更新内容：<br>
 2.2.1、优化方法名命名规范
 2.2.2、优化网络状态实时监测 block 回调，去除多余设置，需要网络判断，直接调用block回调即可
 2.2.3、新增 YYCache 缓存处理
 2.2.4、新增自定义：超时设置
 2.2.5、新增自定义：requestSerializer设置
 2.2.6、新增自定义：responseSerializer设置
 2.2.7、新增自定义：请求头设置
 2.2.8、新增自定义 CA 证书 和 HTTPS 请求配置，只需把证书导入项目目录即可，无需设置
 2.2.9、新增史上最全的 AFN 请求 NSLog 打印，详见 demo 控制台打印结果
 2.2.10、新增 DEBUG 模式下的 NSLog 判断，release 下不会打印，请放心使用
 2.2.11、如果打印数据不完整，是因为 Xcode 8 版本问题，请下断点打印数据
 2.2.12、由于新版本改动较大，原有方法命名可能有所改动，希望老用户见谅！
 2.2.13、目前版本较稳定，稍后奉上 pod 版本！请大家耐心等待
 
 最新更新时间：2016-11-24 【倒叙】
 最新Version：【Version：2.1】
 更新内容：
 2.1.1、优化方法名命名规范
 2.1.2、新增网络状态实时监测 block 回调，新增单独网络监测 bool 返回，详见 demo
 2.1.3、新增旧方法更新提示
 2.1.4、优化各种注释
 
 最新更新时间：2016-11-17
 最新Version：【Version：2.0】
 更新内容：
 2.0.1、优化方法名命名规范
 2.0.2、新增部分注释
 2.0.3、视频上传方法对接，目前有很多项目对接成功
 
*/

#endif /* BANetManager_OC_h */
